# Yosys Synth script, pass vars with -D

read_liberty $liberty_filename
read_verilog $input_filename # or directory/project-files
hierarchy -check -top top;
proc; opt; fsm; opt; memory; opt; techmap;
clean;
write_verilog $outfile # or folder
